app/Controllers/carrito2.php

SELECT `carrito`.*, `teclados`.`imagen` as `teclado_imagen`
FROM `carrito`
JOIN `teclados` ON `teclados`.`id_teclado` = `carrito`.`id_teclado`
WHERE `id_user` = '6'
ORDER BY `id_carrito` ASC
---
    public function index()
    {
        $car = new Carritos();

        // Obtener id_user desde la sesión
        $id_user = session('user')->id_user;

        // Obtener los datos del carrito y unirlos con los datos de los teclados
        $datos['carritos'] = $car->select('carrito.*, teclados.imagen as teclado_imagen')
                               ->join('teclados', 'teclados.id_teclado = carrito.id_teclado')
                               ->where('id_user', $id_user)
                               ->orderBy('id_carrito', 'ASC')
                               ->findAll();

SELECT *
FROM `carrito`
WHERE `id_carrito` = '75'
 LIMIT 1
DELETE FROM `carrito`
WHERE `id_carrito` = '75'
---
    public function eliminarcar($id = null)
    {
        $car = new Carritos();

        // Obtener los datos del carrito antes de eliminarlo
        $datosCar = $car->where('id_carrito', $id)->first();

        // Eliminar el carrito por su ID
        $car->where('id_carrito', $id)->delete();