app/Controllers/Carrito.php

    public function index()
    {
        $teclado = new Teclado();

        $datos['teclados'] = $teclado->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `teclados`
ORDER BY `id` ASC

    public function guardar()
    {
        // Obtener los datos del producto desde la segunda vista
        $nombre = $this->request->getVar('nombre');
        $precio = $this->request->getVar('precio');
        $imagen = $this->request->getVar('imagen');

        // Crear una instancia del modelo que representa el carrito
        $carrito = new Carritos();

        // Verificar si el producto ya está en el carrito
        $producto_en_carrito = $carrito->where('nombre', $nombre)->first();

        if ($producto_en_carrito) {
            // Actualizar cantidad
            $carrito->update($producto_en_carrito['id_carrito'], ['cantidad' => $producto_en_carrito['cantidad'] + 1]);
---
SELECT *
FROM `carrito`
WHERE `nombre` = '2222'
 LIMIT 1
UPDATE `carrito` SET `cantidad` = 2
WHERE `carrito`.`id_carrito` IN ('60')