app/Controllers/Login.php

    public function do_login()
    {
        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $rol = $this->request->getPost('rol');

            $result = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'pro@gmail.com'
 LIMIT 1