app/Controllers/Teclados.php

SELECT *
FROM `teclados`
ORDER BY `id` ASC
---
    public function index(){

        $teclado = new Teclado();

        $datos['teclados'] = $teclado->orderBy('id', 'ASC')->findAll();

UPDATE `teclados` SET `nombre` = 'hyperx pro max', `precio` = '20000.99'
WHERE `teclados`.`id` IN ('18')
---
            $imagen->move('../public/uploads', $nuevoNombre);

            $datos=['imagen'=>$nuevoNombre];
            $teclado->update($id,$datos);