app/Controllers/Teclados.php

    public function guardar(){

        $teclado = new Teclado();

        $validacion = $this->validate([
            'nombre' => 'required|min_length[3]|max_length[255]',
            'precio' => 'required|decimal[10,2]',
            'imagen' => [
                'uploaded[imagen]',
                'mime_in[imagen,image/jpg,image/jpeg,image/png]',
                'max_size[imagen,4096]',
            ],
        ]);

        if(!$validacion){
            $session = session();
            $session->setFlashdata('mensaje', 'Verifique la información del formulario');
            return redirect()->back()->withInput();
        }

        if($imagen=$this->request->getFile('imagen')){
            $nuevoNombre = $imagen->getRandomName();
            $imagen->move('../public/uploads', $nuevoNombre);

            $datos=[
                'nombre'=>$nombre= $this->request->getVar('nombre'),
                'precio'=>$precio=$this->request->getVar('precio'),
                'imagen'=>$nuevoNombre
            ];
            $teclado->insert($datos);
---
INSERT INTO `teclados` (`nombre`, `precio`, `imagen`) VALUES ('2222', '2442', '1697033766_a8ef05234ee492dfa958.jpg')